benchmark-results/affinity-test-1/12-1.txt
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 1000000 --ratio=1:0 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 1000000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port --key-pattern G:G
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 100000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 -p $port --key-pattern G:G
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 1000000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port --key-pattern R:R
taskset -c 16-31 memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 100000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 -p $port --key-pattern R:R
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  32 secs]  0 threads:    96000000 ops, 2996081 (avg: 2979380) ops/sec, 193.98MB/sec (avg: 192.90MB/sec),  0.25 (avg:  0.26) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      2692655.20          ---          ---         0.25714         0.26300         0.31100         0.32700         0.35900         0.38300         2.33500         2.51100         3.07100        48.38300    178517.55
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    2692655.20         0.00         0.00         0.25714         0.26300         0.31100         0.32700         0.35900         0.38300         2.33500         2.51100         3.07100        48.38300    178517.55
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  26 secs]  0 threads:    96000000 ops, 7318105 (avg: 3666522) ops/sec, 304.83MB/sec (avg: 152.70MB/sec),  0.10 (avg:  0.21) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       352240.16          ---          ---         0.20871         0.21500         0.29500         0.31100         0.34300         0.36700         1.33500         1.60700         1.85500        48.12700     23388.59
Gets      3522362.84     39024.56   3483338.28         0.20848         0.21500         0.29500         0.31100         0.34300         0.36700         1.32700         1.57500         1.83100        48.12700    141845.59
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    3874602.99     39024.56   3483338.28         0.20850         0.21500         0.29500         0.31100         0.34300         0.36700         1.32700         1.58300         1.83100        48.12700    165234.19
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  11 secs]  0 threads:     9600000 ops,  827243 (avg:  823491) ops/sec, 34.48MB/sec (avg: 34.31MB/sec),  0.12 (avg:  0.12) msec latency

8         Threads
12        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        73818.72          ---          ---         0.11720         0.11900         0.13500         0.16700         0.19900         0.21500         0.80700         1.04700         1.34300         4.57500      4901.50
Gets       738179.09      8777.70    729401.39         0.11658         0.11900         0.13500         0.16700         0.19900         0.21500         0.76700         1.05500         1.30300         4.63900     29739.20
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     811997.81      8777.70    729401.39         0.11663         0.11900         0.13500         0.16700         0.19900         0.21500         0.77500         1.05500         1.31100         4.63900     34640.70
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  26 secs]  0 threads:    96000000 ops, 3124888 (avg: 3584470) ops/sec, 188.77MB/sec (avg: 216.54MB/sec),  0.24 (avg:  0.21) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       327536.81          ---          ---         0.21348         0.21500         0.28700         0.30300         0.34300         0.36700         1.37500         1.59900         1.89500        48.12700     21715.37
Gets      3275332.02   3275332.02         0.00         0.21324         0.21500         0.28700         0.30300         0.34300         0.36700         1.34300         1.59100         1.83900        48.12700    201154.65
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    3602868.83   3275332.02         0.00         0.21326         0.21500         0.28700         0.30300         0.34300         0.36700         1.34300         1.59100         1.84700        48.12700    222870.03
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  11 secs]  0 threads:     9600000 ops,  882187 (avg:  862365) ops/sec, 53.29MB/sec (avg: 52.09MB/sec),  0.11 (avg:  0.11) msec latency

8         Threads
12        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        75398.95          ---          ---         0.11171         0.11100         0.13500         0.15900         0.19900         0.22300         0.73500         0.98300         1.40700         9.53500      4998.42
Gets       753981.22    753981.22         0.00         0.11133         0.11100         0.13500         0.15900         0.19900         0.21500         0.77500         1.05500         1.45500        10.17500     46305.28
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     829380.17    753981.22         0.00         0.11136         0.11100         0.13500         0.15900         0.19900         0.21500         0.77500         1.04700         1.43900        10.17500     51303.71